app/Models/ModelPeminjaman.php

    public function addkoleksi($data)
    {
        return $this->db->table('koleksipribadi')->insert($data);
---
INSERT INTO `koleksipribadi` (`UserID`, `BukuID`) VALUES ('7', '13')

    public function isBukuInKoleksi($bukuId)
    {
        return $this->db->table('koleksipribadi')
                        ->where('BukuID', $bukuId)
                        ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `koleksipribadi`
WHERE `BukuID` = '13'

    public function getAllKoleksi()
    {
        return $this->db->table('koleksipribadi')
                        ->join('buku', 'buku.BukuID = koleksipribadi.BukuID') // Join antara tabel 'buku' dan 'koleksipribadi'
                        ->join('kategoribuku_relasi', 'kategoribuku_relasi.BukuID = koleksipribadi.BukuID') // Join antara tabel 'buku' dan 'koleksipribadi'
                        ->join('kategoribuku', 'kategoribuku_relasi.KategoriID = kategoribuku.KategoriID') // Join antara tabel 'buku' dan 'koleksipribadi'
                        ->join('peminjaman', 'kategoribuku_relasi.BukuID = peminjaman.BukuID') // Join antara tabel 'buku' dan 'koleksipribadi'
                        ->select('koleksipribadi.*, buku.Judul, buku.Penulis, buku.Penerbit, buku.TahunTerbit, buku.gambar_path, kategoribuku.NamaKategori, koleksipribadi.KoleksiID, peminjaman.StatusPeminjaman') // Pilih kolom yang diinginkan
                        ->get()
                        ->getResultArray();
---
SELECT `koleksipribadi`.*, `buku`.`Judul`, `buku`.`Penulis`, `buku`.`Penerbit`, `buku`.`TahunTerbit`, `buku`.`gambar_path`, `kategoribuku`.`NamaKategori`, `koleksipribadi`.`KoleksiID`, `peminjaman`.`StatusPeminjaman`
FROM `koleksipribadi`
JOIN `buku` ON `buku`.`BukuID` = `koleksipribadi`.`BukuID`
JOIN `kategoribuku_relasi` ON `kategoribuku_relasi`.`BukuID` = `koleksipribadi`.`BukuID`
JOIN `kategoribuku` ON `kategoribuku_relasi`.`KategoriID` = `kategoribuku`.`KategoriID`
JOIN `peminjaman` ON `kategoribuku_relasi`.`BukuID` = `peminjaman`.`BukuID`

    public function deleteKoleksi($id)
    {
        return $this->db->table('koleksipribadi')
                        ->where('KoleksiID', $id)
                        ->delete();
---
DELETE FROM `koleksipribadi`
WHERE `KoleksiID` = '3'