app/Models/ModelBuku.php

SELECT `buku`.*, `kategoribuku`.`NamaKategori`
FROM `buku`
JOIN `kategoribuku_relasi` ON `kategoribuku_relasi`.`BukuID` = `buku`.`BukuID`
JOIN `kategoribuku` ON `kategoribuku_relasi`.`KategoriID` = `kategoribuku`.`KategoriID`
---
    public function getBukuWithKategori()
    {
        return $this->db->table('buku')
            ->select('buku.*, kategoribuku.NamaKategori')
            ->join('kategoribuku_relasi', 'kategoribuku_relasi.BukuID = buku.BukuID')
            ->join('kategoribuku', 'kategoribuku_relasi.KategoriID = kategoribuku.KategoriID')
            ->get()
            ->getResultArray();